---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CantCopySymbolicElementToSelfOrientingFamily
source: html/0d1be6ab-f3e2-7eb4-a47f-cd682ccc64ec.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CantCopySymbolicElementToSelfOrientingFamily Property

Cannot copy symbolic elements sketched in non-horizontal planes.

## Syntax (C#)
```csharp
public static FailureDefinitionId CantCopySymbolicElementToSelfOrientingFamily { get; }
```